In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
# Ejercicios 1-Creaciòn de DataFrames

In [4]:
df1 = pd.DataFrame({'numeros': range(20)})
df1

    numeros
0         0
1         1
2         2
3         3
4         4
5         5
6         6
7         7
8         8
9         9
10       10
11       11
12       12
13       13
14       14
15       15
16       16
17       17
18       18
19       19

In [ ]:
#Ejercicio 1.b

In [5]:
df2 = pd.DataFrame({"numeros":np.random.randint(0,2,10)})
df2

   numeros
0        1
1        1
2        1
3        1
4        0
5        1
6        0
7        0
8        0
9        1

In [31]:
#Ejercicio 1.c

In [8]:
df3= pd.concat([df1, df2], axis=1)
df3

    numeros  numeros
0         0      1.0
1         1      1.0
2         2      1.0
3         3      1.0
4         4      0.0
5         5      1.0
6         6      0.0
7         7      0.0
8         8      0.0
9         9      1.0
10       10      NaN
11       11      NaN
12       12      NaN
13       13      NaN
14       14      NaN
15       15      NaN
16       16      NaN
17       17      NaN
18       18      NaN
19       19      NaN

In [15]:
#Ejercicio 1.d

In [10]:
df3.to_csv("df3.csv", index=False)

In [14]:
#Ejercicio 2. Indexación y selección

In [18]:
df = pd.DataFrame({
"A": range(1, 11),
"B": [5,3,6,8,2,9,1,7,4,10]
 })
df

    A   B
0   1   5
1   2   3
2   3   6
3   4   8
4   5   2
5   6   9
6   7   1
7   8   7
8   9   4
9  10  10

In [19]:
df[df["B"] > 5]

    A   B
2   3   6
3   4   8
5   6   9
7   8   7
9  10  10

In [21]:
#Ejercicio 2.b

In [24]:
df.loc[df["B"] < 4, "B"] = pd.NA
df

    A     B
0   1   5.0
1   2   NaN
2   3   6.0
3   4   8.0
4   5   NaN
5   6   9.0
6   7   NaN
7   8   7.0
8   9   4.0
9  10  10.0